Applications-for-kids.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Applications-for-kids</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Applications-for-kids"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-10-26T17:24+0530"/>
<meta name="author" content="Om Prakash Singh"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Applications-for-kids</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 I was trying to figure out some application/games for kids based on Linux to teach my Kid about some programming, I tried to teach him some computer at times and found him very interested in leaning stuff. There must be many for windows but being myself an avid Linux user from quite a long time, I really want to introduce him to Linux quite early, unlike me, who got my hands on Linux late in life and still waiting to explore the endless possiblities it offers.</a>
<ul>
<li>
<ul>
<li><a href="#sec-1-1">1.1 Gcompris :</a></li>
<li><a href="#sec-1-2">1.2 Tux4Kids</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> I was trying to figure out some application/games for kids based on Linux to teach my Kid about some programming, I tried to teach him some computer at times and found him very interested in leaning stuff. There must be many for windows but being myself an avid Linux user from quite a long time, I really want to introduce him to Linux quite early, unlike me, who got my hands on Linux late in life and still waiting to explore the endless possiblities it offers.</h2>
<div class="outline-text-2" id="text-1">


<p>
There is always these question, Why computers? and Why to kids? Are they are smart enough to handle computers. 
We have very common non-sensical answers or myths around which may suggest the Computers are only for grown ups and kids might not be able to handle the strain it may cause to their eyes, yes in this case I do agree, and hence we need to understand to limit their onscreen time; but doing this also we can ensure to learn our kids about computers.
</p>
<p>
Here is a list of few application which I was able to collate using the net and ofcoure google.com :)
</p>

</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1"><span class="section-number-4">1.1</span> <a href="http://gcompris.net/index-en.html">Gcompris</a> :</h4>
<div class="outline-text-4" id="text-1-1">

<p>Gcompris is a suite of around 100 games with different difficulty levels suited for kids between age 2-10, The activities are divided up between sections such as Math, Reading, Amusement. The entire suite is available on most of the distributions standard repostiries. Gcompris is a free software, which means I can adapt it, change it, improve it and most importantly can share this among thousands of other childrens who might want to use it. Below are some of the things Gcompris is offering.
</p>
<ul>
<li>Computer discovery: keyboard, mouse, different mouse gestures, &hellip;
</li>
<li>arithmetic: table memory, enumeration, double entry table, mirror image, &hellip;
</li>
<li>science: the canal lock, the water cycle, the submarine, electric simulation &hellip;
</li>
<li>geography: place the country on the map
</li>
<li>games: chess, memory, connect 4, oware, sudoku &hellip;
</li>
<li>reading: reading practice
</li>
<li>other: learn to tell time, puzzle of famous paintings, vector drawing, cartoon making, &hellip;  
</li>
</ul>


<p>
More information on this project can be found at <a href="http://gcompris.net/index-en.html">Gcompris Website</a>. And <a href="http://en.wikipedia.org/wiki/GCompris">Gcompris Wikipedia</a> does has a simple overview of this project too.
</p>
<p>
On debian or debian alike systems, use
</p>


<pre class="example">sudo apt-get install gcompris
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2"><span class="section-number-4">1.2</span> <a href="http://tux4kids.alioth.debian.org/">Tux4Kids</a></h4>
<div class="outline-text-4" id="text-1-2">

<p>Tux4Kids develops high-quality software for kids, with the goal of combining fun and learning into an irresistable package. Our software is free: you can download it for use at home or onto hundreds of computers in a school. We support all major platforms, including Windows, Macintosh, and Linux/Unix. Our programs are used by people around the globe, and they have been translated into dozens of different languages. As open-source software, these programs can be freely extended or customized, and they are supported by active communities of volunteer developers.
Whether you're a parent, a teacher, or a kid, give Tux4Kids software a try!
</p>
<ul>
<li id="sec-1-2-1">Tuxtype<br/>
Tuxtype is an educational typing tutor for kids starting tux. 




<pre class="example">sudo apt-get install tuxtype
</pre>


<p>
for other installation instrcutions can be found at <a href="http://tux4kids.alioth.debian.org/tuxtype/download.php">http://tux4kids.alioth.debian.org/tuxtype/download.php</a>.
</p>
</li>
</ul>
<ul>
<li id="sec-1-2-2">Tuxpaint<br/>
There is a little painintg program to make your kid learn paint. This lets kids draw things and is good for them to learn moving the mouse and do other stuff. his remarkable drawing program empowers kids to be creative in an environment complete with magic tools and sound effects.




<pre class="example">sudo apt-get install tuxpaint
</pre>


<p>
for other installation instrcutions can be found at <a href="http://www.tuxpaint.org/download/">http://www.tuxpaint.org/download/</a>.
</p>
</li>
</ul>
<ul>
<li id="sec-1-2-3">TuxMath<br/>
Lets kids hone their arithmetic skills while they defend penguins from incoming comets, or offers them a chance to explore the asteroid belt with only their factoring abilities to bring them through safely  




<pre class="example">sudo apt-get install tuxmath
</pre>


<p>
for other installation instrcutions can be found at <a href="http://tux4kids.alioth.debian.org/tuxmath/download.php">http://tux4kids.alioth.debian.org/tuxmath/download.php</a>
</p>
<p>
I think for the beginning I will just go ahead and start with this.  May be when I have to teach him further about programming, I have my list complete with Scratch, Alice and Shoes which may help me if required in the next coming years.
</p>
<p>
BTW, forgot to mention there are real good linux distributions just aimed for kids, and may help kids learn a lot of things on their own while managing their own personal latops. The above utilities are good if you have only one machine and you want your kid to allow to use these too.
</p>
<p>
There are also articles for making to learn kids to program at <a href="http://archive09.linux.com/feature/155203">linux.com</a>. Some of them mentioned are scratch, Alice and Shoes.
</p></li>
</ul>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-10-26T17:24+0530</p>
<p class="author">Author: Om Prakash Singh</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
